{
  "auto_mapping": null,
  "base_model_name_or_path": "m-polignano-uniba/bert_uncased_L-12_H-768_A-12_italian_alb3rt0",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 32,
  "lora_dropout": 0.01,
  "modules_to_save": [
    "classifier"
  ],
  "peft_type": "LORA",
  "r": 16,
  "revision": null,
  "target_modules": [
    "query",
    "value"
  ],
  "task_type": "classifier"
}